CPLMonAvenirApp/app/Models/AnneeScolaire.php

    public static function getAnneeScolaire()
    {
        return AnneeScolaire::where('courant', true)->first();
---
select * from "annee_scolaires" where "courant" = 1 limit 1