CPLMonAvenirApp/app/Http/Controllers/CoursController.php

select * from "cours" where "cours"."classe_id" = 1 and "cours"."classe_id" is not null
select * from "professeurs"
---
    public function index(Classe $classe)
    {
        $data = [
            'classe' => $classe,
            'cours' => $classe->cours,
            'professeurs' => Professeur::all(),
        ];

select * from "professeurs"
---
    public function show(Cours $cours)
    {
        $data = [
            'cours' => $cours,
            'professeurs' => Professeur::all(),
        ];